In [12]:
import pandas as pd
train_df = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\titanic_train.csv')
test_df = pd.read_csv('C:/Users/Vaibhav/Desktop/BA/Datasets/titanic_test.csv')

In [13]:
train_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [14]:
test_df.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [15]:
test_df['Survived'] = -888

In [16]:
test_df.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,-888
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,-888
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,-888

In [17]:
train_df.shape, test_df.shape

((891, 12), (418, 12))

In [66]:
df = pd.concat((train_df, test_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [19]:
df.shape

(1309, 12)

In [20]:
df.head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282

In [21]:
df.tail(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
415,38.5,NaN,S,7.2500,"Saether, Mr. Simon Sivertsen",0,1307,3,male,0,-888,SOTON/O.Q. 3101262
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,1308,3,male,0,-888,359309
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,-888,2668

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       1309 non-null int64
Ticket         1309 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 132.9+ KB

#### Prerequisits for sklearn library:
1. either numpy array or panda dataframe format
2. no missing values
3. all numerical data

Data preprocessing steps:
- structured data
- no missing values
- remove the outliers
- understand the variables which are leading to high variance in the Dependent variable
- understand the inter-correlations between the IVs, because correlated variables are communicating redundant information and lead to over-fitting
- feature engineering

In [25]:
df.isnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,False,True,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,True,False,False,False,False,False,False,False,False,False,False

In [27]:
import numpy as np
np.sum(df.isnull())

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived          0
Ticket            0
dtype: int64

In [29]:
df.notnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,True,False,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,False,True,True,True,True,True,True,True,True,True,True

In [31]:
np.where(df.Age.isnull())

(array([   5,   17,   19,   26,   28,   29,   31,   32,   36,   42,   45,
          46,   47,   48,   55,   64,   65,   76,   77,   82,   87,   95,
         101,  107,  109,  121,  126,  128,  140,  154,  158,  159,  166,
         168,  176,  180,  181,  185,  186,  196,  198,  201,  214,  223,
         229,  235,  240,  241,  250,  256,  260,  264,  270,  274,  277,
         284,  295,  298,  300,  301,  303,  304,  306,  324,  330,  334,
         335,  347,  351,  354,  358,  359,  364,  367,  368,  375,  384,
         388,  409,  410,  411,  413,  415,  420,  425,  428,  431,  444,
         451,  454,  457,  459,  464,  466,  468,  470,  475,  481,  485,
         490,  495,  497,  502,  507,  511,  517,  522,  524,  527,  531,
         533,  538,  547,  552,  557,  560,  563,  564,  568,  573,  578,
         584,  589,  593,  596,  598,  601,  602,  611,  612,  613,  629,
         633,  639,  643,  648,  650,  653,  656,  667,  669,  674,  680,
         692,  697,  709,  711,  718,  727,  732,  738,  739,  740,  760,
         766,  768,  773,  776,  778,  783,  790,  792,  793,  815,  825,
         826,  828,  832,  837,  839,  846,  849,  859,  863,  868,  878,
         888,  901,  913,  920,  924,  927,  930,  932,  938,  945,  949,
         956,  967,  974,  975,  976,  979,  982,  984,  993,  998,  999,
        1002, 1007, 1012, 1015, 1018, 1023, 1024, 1037, 1039, 1042, 1051,
        1054, 1059, 1061, 1064, 1074, 1079, 1082, 1090, 1091, 1096, 1102,
        1107, 1110, 1116, 1118, 1124, 1134, 1135, 1140, 1146, 1147, 1156,
        1157, 1158, 1159, 1162, 1164, 1165, 1173, 1177, 1179, 1180, 1181,
        1183, 1188, 1192, 1195, 1203, 1223, 1230, 1233, 1235, 1248, 1249,
        1256, 1257, 1271, 1273, 1275, 1299, 1301, 1304, 1307, 1308],
       dtype=int64),)

In [33]:
#name and survival status for all the passengers having missing values in age
df.loc[df.Age.isnull(), ['Name', 'Survived']].head(3)

                            Name  Survived
5               Moran, Mr. James         0
17  Williams, Mr. Charles Eugene         1
19       Masselmani, Mrs. Fatima         1

In [34]:
#to delete all the rows having null values
titanic_nona = df.dropna()

In [36]:
titanic_nona.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 270 entries, 1 to 414
Data columns (total 12 columns):
Age            270 non-null float64
Cabin          270 non-null object
Embarked       270 non-null object
Fare           270 non-null float64
Name           270 non-null object
Parch          270 non-null int64
PassengerId    270 non-null int64
Pclass         270 non-null int64
Sex            270 non-null object
SibSp          270 non-null int64
Survived       270 non-null int64
Ticket         270 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 27.4+ KB

In [38]:
df['Age'] = df['Age'].fillna(df.Age.mean(skipna=True))

In [41]:
df[['Age']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 1 columns):
Age    1309 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

In [43]:
df.Embarked.value_counts(dropna=False)

S      914
C      270
Q      123
NaN      2
Name: Embarked, dtype: int64

In [44]:
df.Embarked = df.Embarked.fillna('S')

In [46]:
df[["Fare"]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 1 columns):
Fare    1308 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

In [53]:
from sklearn.preprocessing import Imputer

In [201]:
df = pd.concat((train_df, test_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [189]:
np.where(df.Age.isnull())

(array([   5,   17,   19,   26,   28,   29,   31,   32,   36,   42,   45,
          46,   47,   48,   55,   64,   65,   76,   77,   82,   87,   95,
         101,  107,  109,  121,  126,  128,  140,  154,  158,  159,  166,
         168,  176,  180,  181,  185,  186,  196,  198,  201,  214,  223,
         229,  235,  240,  241,  250,  256,  260,  264,  270,  274,  277,
         284,  295,  298,  300,  301,  303,  304,  306,  324,  330,  334,
         335,  347,  351,  354,  358,  359,  364,  367,  368,  375,  384,
         388,  409,  410,  411,  413,  415,  420,  425,  428,  431,  444,
         451,  454,  457,  459,  464,  466,  468,  470,  475,  481,  485,
         490,  495,  497,  502,  507,  511,  517,  522,  524,  527,  531,
         533,  538,  547,  552,  557,  560,  563,  564,  568,  573,  578,
         584,  589,  593,  596,  598,  601,  602,  611,  612,  613,  629,
         633,  639,  643,  648,  650,  653,  656,  667,  669,  674,  680,
         692,  697,  709,  711,  718,  727,  732,  738,  739,  740,  760,
         766,  768,  773,  776,  778,  783,  790,  792,  793,  815,  825,
         826,  828,  832,  837,  839,  846,  849,  859,  863,  868,  878,
         888,  901,  913,  920,  924,  927,  930,  932,  938,  945,  949,
         956,  967,  974,  975,  976,  979,  982,  984,  993,  998,  999,
        1002, 1007, 1012, 1015, 1018, 1023, 1024, 1037, 1039, 1042, 1051,
        1054, 1059, 1061, 1064, 1074, 1079, 1082, 1090, 1091, 1096, 1102,
        1107, 1110, 1116, 1118, 1124, 1134, 1135, 1140, 1146, 1147, 1156,
        1157, 1158, 1159, 1162, 1164, 1165, 1173, 1177, 1179, 1180, 1181,
        1183, 1188, 1192, 1195, 1203, 1223, 1230, 1233, 1235, 1248, 1249,
        1256, 1257, 1271, 1273, 1275, 1299, 1301, 1304, 1307, 1308],
       dtype=int64),)

In [191]:
np.where(df.Fare.isnull())

(array([1043], dtype=int64),)

In [202]:
#used only for imputing the null values in numerical columns - strategy is mean / median / most_frequent
imputer = Imputer(missing_values='NaN', strategy = "median", axis = 0)
df.loc[:,['Fare','Age']] = imputer.fit_transform(df.loc[:,["Fare",'Age']])

In [199]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [203]:
df.iloc[1043,3], np.median(df.Fare), df.iloc[5,0], np.median(df.Age)

(14.4542, 14.4542, 28.0, 28.0)

In [65]:
df[["Fare"]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 1 columns):
Fare    1309 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

In [204]:
df = pd.concat((train_df, test_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       1309 non-null int64
Ticket         1309 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 132.9+ KB

In [205]:
imputer = Imputer(missing_values='NaN', strategy = "most_frequent", axis = 0)
imputer.fit(df[['Fare', 'Age']]) #this will only compute the median

Imputer(axis=0, copy=True, missing_values='NaN', strategy='most_frequent',
    verbose=0)

In [77]:
df[['Fare']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 1 columns):
Fare    1308 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

In [206]:
df[['Fare', 'Age']] = imputer.transform(df[['Fare', 'Age']]) #to transform the column Fare

In [207]:
df.iloc[1043,3], np.median(df.Fare), df.iloc[5,0], np.median(df.Age)

(8.05, 14.4542, 24.0, 24.0)

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1309 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1309 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       1309 non-null int64
Ticket         1309 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 132.9+ KB

In [208]:
df = pd.concat((train_df, test_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [88]:
#if it is female (i.e for the missing value of age) - then the median age of the female 
#will be imputed and if it male, then the median age of males will be imputed
df.groupby('Sex').Age. median()

Sex
female    27.0
male      28.0
Name: Age, dtype: float64

In [209]:
df.Age = df.groupby('Sex').Age.transform('median')

In [211]:
df.Age.isnull().sum() #Age imputed by the median age represented by the sex

0

In [90]:
df.groupby('Pclass').Age.transform('mean')

0      24.816367
1      39.159930
2      24.816367
3      39.159930
4      24.816367
5      24.816367
6      39.159930
7      24.816367
8      24.816367
9      29.506705
10     24.816367
11     39.159930
12     24.816367
13     24.816367
14     24.816367
15     29.506705
16     24.816367
17     29.506705
18     24.816367
19     24.816367
20     29.506705
21     29.506705
22     24.816367
23     39.159930
24     24.816367
25     24.816367
26     24.816367
27     39.159930
28     24.816367
29     24.816367
         ...
388    24.816367
389    24.816367
390    39.159930
391    39.159930
392    24.816367
393    29.506705
394    24.816367
395    39.159930
396    24.816367
397    39.159930
398    24.816367
399    24.816367
400    39.159930
401    29.506705
402    39.159930
403    39.159930
404    39.159930
405    29.506705
406    29.506705
407    39.159930
408    24.816367
409    24.816367
410    24.816367
411    39.159930
412    24.816367
413    24.816367
414    39.159930
415    24.816367
416    24.816367
417    24.816367
Name: Age, Length: 1309, dtype: float64

In [ ]:
#replace the median age according to the title

In [92]:
df.Name[:3]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [100]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [101]:
name = df.iloc[0, 4]

In [102]:
name

'Braund, Mr. Owen Harris'

In [108]:
def GetTitle(name):
    title = name.split(',')[1].split('.')[0].lower()
    
        
    
    return(title)

In [109]:
GetTitle(name)

' mr'

In [115]:
df['Title'] = df.Name.map(lambda x: GetTitle(x))

In [116]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title'],
      dtype='object')

In [117]:
df.Title

0           mr
1          mrs
2         miss
3          mrs
4           mr
5           mr
6           mr
7       master
8          mrs
9          mrs
10        miss
11        miss
12          mr
13          mr
14        miss
15         mrs
16      master
17          mr
18         mrs
19         mrs
20          mr
21          mr
22        miss
23          mr
24        miss
25         mrs
26          mr
27          mr
28        miss
29          mr
        ...
388         mr
389     master
390         mr
391        mrs
392     master
393         mr
394         mr
395        mrs
396         mr
397        mrs
398         mr
399         mr
400       miss
401         mr
402       miss
403         mr
404         mr
405         mr
406         mr
407         mr
408       miss
409       miss
410       miss
411        mrs
412       miss
413         mr
414       dona
415         mr
416         mr
417     master
Name: Name, Length: 1309, dtype: object

In [118]:
df.Title.unique()

array([' mr', ' mrs', ' miss', ' master', ' don', ' rev', ' dr', ' mme',
       ' ms', ' major', ' lady', ' sir', ' mlle', ' col', ' capt',
       ' the countess', ' jonkheer', ' dona'], dtype=object)

In [138]:

title_group = { 'mr' : 'Mr',
               'mrs' : 'Mrs',
               'miss':'Miss',
               'master': 'Master',
               'don': 'Sir',
               'rev': 'Sir',
               'dr': 'Officer',
               'mme': 'Mrs',
               'ms': 'Mrs',
               'major': 'Officer',
               'lady': 'Lady',
               'sir': 'Sir',
               'mlle': 'Miss',
               'col': 'Officer',
               'capt': 'Officer',
               'the countess': 'Lady',
               'jonkheer': 'Sir',
               'dona': 'Lady'}

In [123]:
title_group['master']

'Master'

In [146]:
def GetTitle(name):
    title = name.split(',')[1].split('.')[0].strip().lower()
    
    
    title_group = { 'mr' : 'Mr',
               'mrs' : 'Mrs',
               'miss':'Miss',
               'master': 'Master',
               'don': 'Sir',
               'rev': 'Sir',
               'dr': 'Officer',
               'mme': 'Mrs',
               'ms': 'Mrs',
               'major': 'Officer',
               'lady': 'Lady',
               'sir': 'Sir',
               'mlle': 'Miss',
               'col': 'Officer',
               'capt': 'Officer',
               'the countess': 'Lady',
               'jonkheer': 'Sir',
               'dona': 'Lady'}
        
    
    return(title_group[title])

In [140]:
name
title = name.split(',')[1].split('.')[0].strip().lower()
title

'mr'

In [149]:
GetTitle(name)

'Mr'

In [150]:
df['Title']=df.Name.map(lambda x: GetTitle(x))

In [152]:
df['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Sir', 'Officer', 'Lady'],
      dtype=object)

In [154]:
df.groupby('Title').Age.transform('median')[:3]

0    29.0
1    35.0
2    22.0
Name: Age, dtype: float64

In [156]:
df.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148', 'B45', 'B36', 'A21', 'D34', 'A9', 'C31', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C55 C57', 'C116', 'F', 'A29', 'C6', 'C28',
       'C51', 'C97', 'D22', 'B10', 'E45', 'E52', 'A11', 'B11', 'C80',
       'C89', 'F E46', 'B26', 'F E57', 'A18', 'E60', 'E39 E41',
       'B52 B54 B56', 'C39', 'B24', 'D40', 'D38', 'C105'], dtype=object)

In [159]:
np.sum(df[['Cabin']].isnull())

Cabin    1014
dtype: int64

In [161]:
df[df.Cabin=='T']

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title
339,45.0,T,S,35.5,"Blackwell, Mr. Stephen Weart",0,340,1,male,0,0,113784,Mr

In [162]:
df.loc[df.Cabin=='T', 'Cabin'] = np.NaN

In [166]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title'],
      dtype='object')

In [169]:
deck  = df.iloc[1,1]
deck

'C85'

In [171]:
deck[0].upper()

'C'

In [175]:
np.where(df.Cabin.notnull(), 'x', 'y') #where-ever true is returned by the condition, put x else put y

array(['y', 'x', 'y', ..., 'y', 'y', 'y'], dtype='<U1')

In [179]:
np.where(pd.notnull(deck), str(deck)[0].upper(), 'Z')

array('C', dtype='<U1')

In [180]:
def getdeck(deck):
    a = np.where(pd.notnull(deck), str(deck)[0].upper(), 'Z')
    return a

In [181]:
df['Deck'] = df['Cabin'].map(lambda x: getdeck(x))

In [183]:
df.Deck[:3]

0    Z
1    C
2    Z
Name: Deck, dtype: object

In [184]:
#crosstab to find the survival rate according to cabin
pd.crosstab(df[df.Survived!= -888].Survived , df[df.Survived!= -888].Deck)
# We have to find out if deck is a significant variable in predicting the survival rate. This can be predicted only if as the deck varies, survival rate varies significantly

Deck      A   B   C   D   E  F  G    Z
Survived
0         8  12  24   8   8  5  2  482
1         7  35  35  25  24  8  2  206

In [185]:
#survival rate for deck A? 7/15
7/15

0.4666666666666667

In [186]:
35/47

0.7446808510638298

In [187]:
24/59

0.4067796610169492